"""
Имя проекта: Rabota1
Номер версии: 1.0
Имя файла: Rabota1(№5).py
Автор: 2020 © В.А.Шаровский, Челябинск
Лицензия использования: CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 15.12.2020
Дата последней модификации: 15.12.2020
Описание: Решение задачи №5 Практикума №1
Описание: Известен объем информации в байтах. Перевести в килобайты, мегабайты.
# Версия Python: 3.9
"""

b = 256
klb = float (b) / float (1024)
mgb = float (klb) / float (1024)
print (klb)
print (mgb)
