"""
Имя проекта: Rabota1
Номер версии: 1.0
Имя файла: Rabota1(№21).py
Автор: 2020 © В.А.Шаровский, Челябинск
Лицензия использования: CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 16.12.2020
Дата последней модификации: 16.12.2020
Описание: Решение задачи №21 Практикума №1
Описание: Определить значение функции Z = 1/(XY) при произвольных X и Y.
# Версия Python: 3.9
"""

x = int(input("Введите Х:"))
y = int(input("Введите У:"))
z = 1 / (x*y)
print("Значение ф-ии равно",z)
