"""
Имя проекта: Rabota1
Номер версии: 1.0
Имя файла: Rabota1(№2).py
Автор: 2020 © В.А.Шаровский, Челябинск
Лицензия использования: CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 15.12.2020
Дата последней модификации: 15.12.2020
Описание: Решение задачи №2 Практикума №1
Описание: Даны действительные числа А, В, С. Найти максимальное и минимальное из этих чисел.
# Версия Python: 3.9
"""

A = 66
B = 92
C = 45
print(max(A,B,C))
print(min(A,B,C))
