"""
Имя проекта: Rabota1
Номер версии: 1.0
Имя файла: Rabota1(№6).py
Автор: 2020 © В.А.Шаровский, Челябинск
Лицензия использования: CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 15.12.2020
Дата последней модификации: 15.12.2020
Описание: Решение задачи №6 Практикума №1
Описание: Определить значение функции Z=1/(XY) при X и Y не равных 0.
# Версия Python: 3.9
"""

X = 1
Y = 0
if X != 0 and Y != 0:
    Z = 1 / (X * Y)
    print(Z)
else:
    print("Неопределенность")
